app/helpers/application_helper.rb

  def current_order
      if !session[:order_id].nil?
        Order.find(session[:order_id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1