app/controllers/home_controller.rb

SELECT `products`.* FROM `products`
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
---
  def index
    ###Search
    @q = Product.search(params[:q])
    @products = @q.result
    #@products = Product.all
    @order_item = current_order.order_items.new