app/controllers/order_items_controller.rb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
INSERT INTO `order_items` (`product_id`, `order_id`, `unit_price`, `quantity`, `created_at`, `updated_at`, `total_price`) VALUES (1, 1, 1.0, 1, '2020-07-17 01:43:28.311940', '2020-07-17 01:43:28.311940', 1.0)
INSERT INTO `orders` (`subtotal`, `created_at`, `updated_at`) VALUES (1.0, '2020-07-17 01:43:28.294374', '2020-07-17 01:43:28.294374')
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save

UPDATE `orders` SET `orders`.`subtotal` = 1.3000304460674412e+16, `orders`.`updated_at` = '2020-07-17 09:57:15.693160' WHERE `orders`.`id` = 1
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)