app/controllers/products_controller.rb

  def index
    @q = Product.search(params[:q])
---
SELECT `products`.* FROM `products`

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO `products` (`title`, `price`, `created_at`, `updated_at`) VALUES ('test_4444', 1.0, '2020-07-17 04:44:20.566914', '2020-07-17 04:44:20.566914')

  def edit
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 7 LIMIT 1
UPDATE `products` SET `products`.`price` = 100000.0, `products`.`updated_at` = '2020-07-17 04:44:29.569407' WHERE `products`.`id` = 7

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1