app/views/layouts/application.html.erb

            <ul class="nav navbar-nav navbar-right">
              <li class="active"><%= link_to "#{current_order.order_items.size} items in card and price #{current_order.subtotal}"%></li>
---
SELECT COUNT(*) FROM `order_items` WHERE `order_items`.`order_id` = 1